HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/cylinder/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    "(sides|frontAndBack)"
    {
        type            calculated;
        value           $internalField;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
