HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/cylinder/0.orig/wallFilmRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilmRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    wallFilmFaces_top
    {
        type            zeroGradient;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
